Repository: Centalki-team/centalki
Catalog: lib/l10n/intl_*.arb
Languages: vi

# txtTopicVocabHint
source: We appreciate if you could tell us which phrases and/or examples cause the problems.
vi: Chúng tôi đánh giá cao nếu bạn có thể cho chúng tôi biết cụm từ và/hoặc ví dụ nào gây ra vấn đề.

# txtTopicQnaHint
source: We appreciate if you could tell us which questions and/or answers cause the problems.
vi: Chúng tôi đánh giá cao nếu bạn có thể cho chúng tôi biết những câu hỏi và/hoặc câu trả lời nào gây ra sự cố.

# txtOf
source: of
vi: trên

# txtNotFinishFeedback
source: Unfinished Feedback Submission
vi: Góp ý chưa hoàn thành

# txtNotFinishFeedbackContent
source: Are you sure you want to exit and return to the previous screen? Your feedbacks are invaluable to us.
vi: Bạn có muốn chắc chắn thoát ra và trở về màn trình trước đó không? Góp ý của bạn rất có giá trị với chúng tôi.

# txtFeedbackSuccess
source: Feedback Sent Successfully
vi: Gửi góp ý thành công

# txtFeedbackSuccessContent
source: We are deeply appreciated the efforts you took to help us further improve our contents. We always look forward to hearing more ideas from you.
vi: Chúng tôi rất cảm kích khi bạn đã dành thời gian giúp cải thiện nội dung trên hệ thống. Chúng tôi luôn sẵn sàng lắng nghe các ý kiến từ bạn.

# txtStayBtn
source: Stay
vi: Ở lại

# txtExitBtn
source: Exit
vi: Thoát

# txtVocabLearningSuggestion
source: This feature works better with at least 10 saved phrases.
vi: Tính năng này hoạt động tốt nhất khi bạn đã lưu ít nhất 10 từ vựng.

# txtStartBtn
source: Start
vi: Bắt đầu

# txtCompleteRemind
source: You have completed studying 5 phrases. Try to maintain this every day.
vi: Bạn đã hoàn thành buổi học từ vựng hôm nay. Cố gắng duy trì thói quen mỗi ngày nhé.

# txtEndBtn
source: End
vi: Kết thúc

# txtCompleteBtn
source: Complete
vi: Hoàn thành

# txtEndProgress
source: End progress
vi: Kết thúc quá trình học

# txtEndProgressContent
source: Are you sure to finish to learn vocabularies?
vi: Bạn có chắc chắn muốn kết thúc buổi học từ vựng hôm nay?

# txtStillWantToLearnMore
source: Still want to learn more?
vi: Vẫn muốn học thêm?

# txtOfCourse
source: Of course
vi: Đương nhiên

# txtThatEnoughForToday
source: That is enough for today
vi: Hôm nay vậy là đủ

# txtNotifications
source: Notifications
vi: Thông báo

# txtNoNotiToShow
source: No Notifications To Show
vi: Không có thông báo để hiển thị

# txtNotiWillUpdateRemind
source: This screen will update whenever there is something new for you.
vi: Chúng tôi sẽ luôn cập nhật các tin tức mới nhất cho bạn và hiển thị chúng ở đây

# txtToday
source: Today
vi: Hôm nay

# txtThisWeek
source: This week
vi: Tuần này

# txtPrevious
source: Previous Notifications
vi: Trước đó

# txtTopicSuggestion
source: Topic Suggestion
vi: Đề xuất chủ đề

# txtSubjectLabel
source: Subject and Category
vi: Chủ đề và thể loại

# txtSubjectSubTitle
source: You can give us general ideas of the topics you wish to be available. It's best to suggest 1 idea every time, so that we can manage them more efficiently.
vi: Bạn có thể cung cấp các ý tưởng sơ khai về chủ đề bạn mong muốn. Chúng tôi sẽ xử lý hiệu quả hơn nếu bạn chỉ đề xuất một chủ đề mỗi lần.

# txtSubjectHint
source: e.g. I want a topic about extracurricular activities in college and university, pros and cons of fast food, studying abroad, etc.
vi: Ví dụ: tôi muốn một chủ đề về các hoạt động ngoại khóa bậc đại học; lợi và hại của thức ăn nhanh; vấn đề về du học; v.v..

# txtLevelLabel
source: Level and Difficulty
vi: Cấp độ và độ khó

# txtLevelSubTitle
source: You could provide us the desired difficulty of the topics you wish for
vi: Bạn có thể cung cấp độ khó mà bạn mong muốn cho chủ đề trên

# txtDescriptionAndRequirementsLabel
source: Description and Specific Requirements
vi: Mô tả và yêu cầu cụ thể

# txtDescriptionAndRequirementsSubTitle
source: We are thankful if you could share with us the details, preferences, and other specific ideas for the topic
vi: Sẽ rất tuyệt vời nếu bạn nêu ra các sợ thích và ý tưởng cụ thể cho chủ đề

# txtDescriptionAndRequirementsHint
source: e.g. explores the pros and cons of fast food, examining both sides of the debate and providing insight into the potential benefits and drawbacks of this popular food choice.
vi: Ví dụ: khám phá lợi ích và tác hại của thức ăn nhanh, xem xét vấn đề từ nhiều phía, các góc nhìn khác nhau về loại thức ăn được ưa chuộng này

# txtSubjectNotEmpty
source: Subject and Category cannot be empty
vi: Chủ đề và thể loại không được bỏ trống

# txtSubjectTooLong
source: Subject and Category cannot exceed 200 characters
vi: Chủ đề và thể loại không thể vượt quá 200 ký tự

# txtDescriptionAndRequirementsTooLong
source: Description and Specific Requirements cannot exceed 500 characters
vi: Mô tả và yêu cầu cụ thể không thể vượt quá 500 ký tự

# txtNotFinishTopicSuggest
source: Unfinished Topic Suggestion
vi: Đề xuất chưa hoàn thành

# txtNotFinishTopicSuggestContent
source: Are you sure you want to exit and return to the previous screen? Your suggestions are invaluable to us.
vi: Bạn có muốn chắc chắn thoát ra và trở về màn trình trước đó không? Những đề xuất của bạn rất có giá trị với chúng tôi.

# txtSendTopicSuggestSuccess
source: Suggestion Sent Successfully
vi: Gửi đề xuất thành công

# txtSendTopicSuggestSuccessContent
source: We are deeply appreciated the efforts you took to help us further improve our contents. We always look forward to hearing more ideas from you.
vi: Chúng tôi rất cảm kích khi bạn đã dành thời gian giúp cải thiện nội dung trên hệ thống. Chúng tôi luôn sẵn sàng lắng nghe các ý tưởng mới từ bạn.

# txtPurchase
source: Purchase
vi: Mua

# txtMostPopular
source: Most Popular
vi: Phổ biến nhất

# txtBestValue
source: Best Value
vi: Tốt nhất

# txtOneSession
source: 1 session
vi: 1 buổi học

# txtSixSessions
source: 6 sessions
vi: 6 buổi học

# txtOneSessionLearningTime
source: Total 30 minutes of learning time
vi: Tổng thời gian học 30 phút

# txtSixSessionsLearningTime
source: Total 180 minutes of learning time
vi: Tổng thời gian học 180 phút

# txtQualityVideoCall
source: High-quality video call
vi: Cuộc gọi video chất lượng cao

# txtSave16Percent
source: Save 8%
vi: Tiết kiệm 8%
