Repository: Centalki-team/centalki
Catalog: lib/l10n/intl_*.arb
Languages: vi

source: Topic
vi: Chủ đề

source: Favorite
vi: Yêu thích

source: Account
vi: Tài khoản

source: Settings
vi: Cài đặt

# txtEmailEmptyWarning
source: E-mail address cannot be empty
vi: Địa chỉ email không được để trống

# txtEmailInvalidFormatWarning
source: Invalid email format
vi: Email chưa đúng định dạng

# txtPasswordEmptyWarning
source: Password cannot be empty
vi: Mật khẩu không được để trống

# txtNoUserFoundForEmail
source: No user found for that email!
vi: Không tồn tại người dùng với email này!

# txtWrongPasswordProvided
source: Wrong password provided for that user.
vi: Sai mật khẩu với tài khoản này!

# txtSignInYourAccount
source: Sign in your account
vi: Đăng nhập vào tài khoản của bạn

# txtNotAccount
source: Don't have an account?
vi: Chưa có tài khoản?

# txtForgotPasswordIntroduction
source: Your email used to sign in Centalki
vi: Email bạn dùng để đăng nhập vào Centalki

# txtReturnSignIn
source: Return Sign In
vi: Quay về trang đăng nhập

# txtWelcomeSignIn
source: Speak English Everyday
vi: Luyện nói tiếng Anh mỗi ngày

# txtWelcomeForgotPassword
source: Connect and share your English knowledge
vi: Kết nối và chia sẻ kiến thức tiếng Anh của bạn

# txtGetStarted
source: Get Started
vi: Bắt đầu

# txtEmailEmpty
source: Email address cannot be empty
vi: Địa chỉ email không được để trống

# txtEmailInvalidFormat
source: Invalid email format
vi: Email chưa đúng định dạng

# txtFullNameEmpty
source: Full name cannot be empty
vi: Họ tên không được để trống

# txtFullNameTooShort
source: Name must contain at least 2 non-whitespace characters
vi: Tên phải chứa ít nhất 2 ký tự không phải khoảng trắng

# txtFullNameTooLong
source: Name cannot exceed 50 characters
vi: Tên không được vượt quá 50 ký tự

# txtFullNameOnlyCharacters
source: Full name just contains characters
vi: Họ tên chỉ bao gồm chữ cái

# txtEngNameTooShort
source: English name must contain at least 2 non-whitespace characters
vi: Tên tiếng Anh phải chứa ít nhất 2 ký tự không phải khoảng trắng

# txtEngNameTooLong
source: English name cannot exceed 50 characters
vi: Tên tiếng Anh không được vượt quá 50 ký tự

# txtEngNameOnlyCharacters
source: English name just contains characters
vi: Tên tiếng Anh chỉ bao gồm chữ cái

# txtBioTooLong
source: Your biography cannot exceed 200 characters
vi: Tiểu sử của bạn không thể vượt quá 200 ký tự

# txtPasswordEmpty
source: Password cannot be empty
vi: Mật khẩu không được để trống

# txtPasswordTooShort
source: Password must contain at least 8 characters
vi: Mật khẩu phải chứa ít nhất 8 ký tự

# txtPasswordTooLong
source: Password cannot exceed 100 characters
vi: Mật khẩu không được vượt quá 100 ký tự

# txtPasswordNotValid
source: Password must contain at least 1 uppercase, 1 numeric and 1 special character
vi: Mật khẩu phải chứa ít nhất 1 chữ hoa, 1 chữ thường, 1 số và 1 ký tự đặc biệt

# txtRetypePasswordEmpty
source: Please enter your password again
vi: Vui lòng điền lại mật khẩu lần nữa

# txtRetypePasswordNotMatch
source: Retyped password mismatched
vi: Mật khẩu điền lại không khớp

# txtTermsNotAgreed
source: Please agree with our Terms & Conditions
vi: Vui lòng đồng ý với Điều khoản Dịch vụ của chúng tôi

# txtEmailUsed
source: Email is used by another account
vi: Email đã được dùng bởi tài khoản khác

# txtSignInError
source: Sign in error
vi: Lỗi đăng nhập

# txtUserNotFound
source: User not found for that email!
vi: Không tìm thấy người dùng với email này!

# txtWrongPassword
source: Wrong password!
vi: Sai mật khẩu!

# txtWeakPassword
source: The password provided is too weak!
vi: Mật khẩu quá yếu!

# txtNotValidateRole
source: Cannot verify role!
vi: Không thể xác thực phân quyền!

# txtPassword
source: Password
vi: Mật khẩu

# txtFullName
source: Full name
vi: Họ tên

# txtRetypePassword
source: Retype Password
vi: Nhập lại mật khẩu

# txtHaveNoAccount
source: Have no account?
vi: Chưa có tài khoản?

# txtHaveAnAccount
source: Have an account?
vi: Đã có tài khoản?

# txtTermsAccept
source: I accept
vi: Tôi đồng ý

# txtSignInIntroduction
source: Sign in to practice your English speaking skill
vi: Đăng nhập để bắt đầu luyện tập kỹ năng nói tiếng Anh

# txtSignUpIntroduction
source: Sign up to discover Centalki
vi: Đăng ký tài khoản để khám phá Centalki

# txtResetPasswordIntroduction
source: Enter email used for sign in our app
vi: Nhập địa chỉ email mà bạn đã dùng để đăng ký tài khoản

# txtResetPasswordDescription
source: Didn't receive any email? Try looking up in your Spams or try again after 1 minute
vi: Không nhận được email? Hãy kiểm tra trong mục thư rác của bạn hoặc thử lại sau 1 phút.

# txtSignIn
source: Sign In
vi: Đăng nhập

# txtSignUp
source: Sign Up
vi: Đăng ký

# txtSignUpResult
source: Sign up result
vi: Kết quả đăng ký

# txtNext
source: Next
vi: Tiếp theo

# txtResetPassword
source: Reset Password
vi: Đặt lại mật khẩu

# txtResetPasswordResult
source: Reset password result
vi: Kết quả đặt lại mật khẩu

# txtReturnToSignIn
source: Go to Sign In
vi: Quay lại trang đăng nhập

# txtForgotPassword
source: Forgot Password?
vi: Quên mật khẩu?

# txtTerms
source: Terms & Conditions
vi: Điều khoản Dịch vụ

# txtVerifyEmailTitle
source: Thank you!
vi: Cảm ơn!

# txtVerifyEmailContent
source: We appreciate your interest in our application. To ensure the quality and security of our service, all users MUST verify their email address within 24 hours.
vi: Chúng tôi rất trân trọng sự quan tâm của bạn đến ứng dụng của chúng tôi. Để đảm bảo chất lượng và an ninh của dịch vụ chúng tôi, tất cả người dùng PHẢI xác minh địa chỉ email của họ trong vòng 24 giờ.

# txtVerifyEmailContent2
source: If you're still seeing this message after successfully verified your email, consider Signing Out and Signing In again
vi: Nếu bạn vẫn thấy thông báo này sau khi đã xác minh địa chỉ email thành công, hãy thử Đăng xuất và Đăng nhập lại.

# txtSearchError
source: Topics name cannot exceed 100 characters
vi: Tên chủ đề không thể vượt quá 100 ký tự

# txtTopicDetail
source: Topic Detail
vi: Nội dung chủ đề

# txtTalk
source: Talk
vi: Bắt đầu luyện nói

# txtTopicCategory
source: Category
vi: Thể loại

# txtTopicLevel
source: Level
vi: Cấp độ

# txtTopicDescription
source: Description
vi: Mô tả

# txtTopicVocab
source: Vocabulary
vi: Từ vựng

# txtTopicQuestions
source: Recommended Questions
vi: Câu hỏi gợi ý

# txtTopicPhraseExample
source: Example
vi: Ví dụ

# txtTopicAnswers
source: Answers
vi: Câu trả lời mẫu

# txtNoResultFound
source: No Result Found
vi: Không tìm thấy kết quả nào

# txtSearchSr
source: Sorry! We could not find any topic that matches your search criteria.
vi: Rất tiếc! Chúng tôi không thể tìm thấy chủ đề nào khớp với yêu cầu bạn đưa ra.

# txtSearchPlsTryAgain
source: Please consider trying again with different keywords.
vi: Bạn có thể cân nhắc sử dụng từ khóa khác.

# txtSearchSuggestTopic
source: It is possible that the topics you are looking for are not yet available in our system.
vi: Có khả năng các chủ đề bạn đang tìm kiếm hiện chưa có trên hệ thống của chúng tôi.

# txtSuggestTopicBtn
source: Suggest Topic
vi: Đề xuất chủ đề

# txtCancel
source: Cancel
vi: Huỷ

# txtYes
source: Yes
vi: Có

# txtNo
source: No
vi: Không

# txtCancelTitle
source: Cancel connecting
vi: Huỷ kết nối

# txtCancelContent
source: Are you sure to cancel connecting to teacher?
vi: Bạn có chắc chắn muốn huỷ kết nối tới giáo viên không?

# txtFindTeacher
source: Finding teacher for you...
vi: Đang tìm giáo viên cho bạn...

# txtFoundedTeacher
source: Teacher found. Connecting...
vi: Đã tìm thấy giáo viên. Đang kết nối...

# txtTryAgain
source: Try Again
vi: Thử lại

# txtConnect
source: Connect
vi: Kết nối

# txtBack
source: Back
vi: Quay lại

# txtGoBack
source: Go to back
vi: Quay lại

# txtNotSignIn
source: Please sign in your account
vi: Vui lòng đăng nhập vào tài khoản của bạn

# txtNotSignInTitle
source: Failure to connect
vi: Kết nối thất bại

# txtSuccessfullyCancel
source: Successfully Cancel
vi: Huỷ thành công

# txtOk
source: OK
vi: Đồng ý

# txtConnectedTeacher
source: Connected to teacher
vi: Kết nối với giáo viên thành công

# txtLaunchSession
source: . Launching session...
vi: . Đang khởi tạo buổi học...

# txtCancelledTitle
source: Cancelled session
vi: Đã huỷ buổi học

# txtCancelledContent
source: The teacher cancelled this session. Do you want to try with another?
vi: Giáo viên đã huỷ buổi học này. Bạn có muốn thử tìm một giáo viên khác không?

# txtNotTeacherAvailableTitle
source: No teacher available
vi: Hiện tại chưa có giáo viên để nhận lớp của bạn

# txtNotTeacherAvailableContent
source: You can try again after 5 minutes
vi: Bạn có thể thử lại sau 5 phút

# txtInternetConnection
source: Please check your internet connection and try again.
vi: Làm ơn kiểm tra lại kết nối mạng và thử lại

# txtLoadFailed
source: Failed to load your profile!
vi: Lỗi không thể tải thông tin cá nhân

# txtStudentProfile
source: Student Profile
vi: Thông tin cá nhân

# txtWallet
source: Wallet
vi: Số dư buổi học

# txtHistory
source: History
vi: Lịch sử

# txtAccountInformation
source: Account Information
vi: Thông tin tài khoản

# txtChangePassword
source: Change Password
vi: Thay đổi mật khẩu

# txtDeleteAccount
source: Delete Account
vi: Xoá tài khoản

# txtSignOut
source: Sign Out
vi: Đăng xuất

# txtSignOutContent
source: Are you sure to sign out of the current account?
vi: Bạn có chắc chắn muốn đăng xuất khỏi tài khoản hiện tại không?

# txtRemainingSessions
source: Remaining
vi: Còn lại

# txtCompletedSessions
source: Completed
vi: Hoàn thành

# txtProfileUpdateFailed
source: Failed to update your profile!
vi: Cập nhật thông tin cá nhân thất bại!

# txtProfileUpdateSuccess
source: Successfully updated your profile!!
vi: Cập nhật thông tin cá nhân thành công!

# txtSaveChanges
source: Save Changes
vi: Lưu các thay đổi

# txtFullNameTitle
source: Full Name
vi: Họ và tên

# txtEnglishNameTitle
source: English Name
vi: Tên tiếng Anh

# txtBioTitle
source: Bio
vi: Tiểu sử

# txtInterestedTopics
source: Interested Topics
vi: Các chủ đề yêu thích

# txtChangeAvatar
source: Change Avatar
vi: Thay đổi ảnh đại diện

# txtFileNotSupported
source: File is not supported
vi: Tệp tin không được hỗ trợ

# txtFileMaximumPerFile
source: The maximum size per file is 2MB.
vi: Dung lượng tối đa mỗi tệp tin là 2MB.

# txtPhoneNumberTitle
source: Phone Number
vi: Số điện thoại

# txtDateOfBirthTitle
source: Date of Birth
vi: Ngày sinh

# txtGenderTitle
source: Gender
vi: Giới tính

# txtConnectionsTitle
source: Connections
vi: Liên hệ

# txtConnected
source: Connected
vi: Đã kết nối

# txtPaymentMethodTitle
source: Payment Method
vi: Phương thức thanh toán

# txtDeleteAccountResult
source: Delete result
vi: Xoá kết quả

# txtReauthenticateAccount
source: Re-authenticate your account
vi: Xác thực lại tài khoản của bạn

# txtReauthenticate
source: Re-authenticate
vi: Xác thực lại

# txtConfirmDeleteAccount
source: Confirm Delete
vi: Xác nhận xoá

# txtEnterPasswordToDelete
source: Please enter your password to continue
vi: Vui lòng nhập mật khẩu để tiếp tục

# txtConfirmDeleteAccountTitle
source: Delete your account?
vi: Xoá tài khoản của bạn?

# txtConfirmDeleteAccountContent
source: You are requesting that your account be deleted. Deleting the account will: • Remove account information and images • Remove all messages • Unable to restore
vi: Bạn đang thực hiện yêu cầu xóa tài khoản. Hành động này sẽ: • Xóa mọi thông tin cá nhân của bạn • Xóa mọi tin nhắn và các dữ liệu liên quan • Không thể khôi phục.

# txtSignInAgainToDelete
source: Please sign in again to delete your account
vi: Vui lòng đăng nhập lại để xoá tài khoản của bạn.

# txtTotalCompletedSessions
source: Total Completed Sessions
vi: Số lượng buổi học đã hoàn thành

# txtTotalTime
source: Total time is
vi: Tổng thời gian là

# txtHours
source: hours
vi: giờ

# txtMinutes
source: minutes
vi: phút

# txtSessions
source: Sessions
vi: Buổi học

# txtNoData
source: No data
vi: Không có dữ liệu để hiển thị

# txtTapToLoadMoreSessions
source: Tap to load more sessions
vi: Chạm để tải thêm danh sách buổi học

# txtBalance
source: Balance
vi: Số dư

# txtOrLoginWith
source: Or log in with
vi: Hoặc đăng nhập bằng

# txtOr
source: or
vi: hoặc

# txtEachSessionDuration
source: The duration of each session is 30 minutes
vi: Thời lượng mỗi buổi học là 30 phút

# txtEachSessionPrice
source: The price of each session is
vi: Chi phí cho mỗi buổi học là

# txt30Minutes
source: /30 minutes
vi: /30 phút

# txtTransactions
source: Transactions
vi: Các giao dịch

# txtNewPasswordEmptyWarning
source: New password cannot be empty
vi: Mật khẩu mới không được để trống

# txtNewPasswordTooShort
source: New password must contain at least 6 characters
vi: Mật khẩu mới phải có độ dài ít nhất 8 ký tự

# txtNewPasswordTooLong
source: New password cannot exceed 100 characters
vi: Mật khẩu mới không được vượt quá 100 ký tự

# txtNewPasswordNotValid
source: New password must contain at least 1 uppercase, 1 numeric and 1 special character
vi: phải chứa ít nhất 1 chữ hoa, 1 chữ thường, 1 số và 1 ký tự đặc biệt

# txtConfirmedPassword
source: Confirmed password must match the new password
vi: Điền lại mật khẩu mới

# txtConfirmedPasswordEmptyWarning
source: Confirmed password cannot be empty
vi: Mật khẩu điền lại không được để trống

# txtConfirmedPasswordTooLong
source: Confirm password cannot exceed 100 characters
vi: Mật khẩu điền lại không thể vượt quá 100 ký tự

# txtConfirmedPasswordMatchWarning
source: Confirm password must match the new password
vi: Mật khẩu điền lại không khớp

# txtChangePasswordError
source: Something went wrong. Please try again later!
vi: Đã xảy ra lỗi. Vui lòng thử lại sau!

# txtUserNotSignIn
source: User does not sign in!
vi: Người dùng chưa đăng nhập

# txtChangePasswordResult
source: Change password result
vi: Kết quả thay đổi mật khẩu

# txtSuccessfullyChanged
source: Successfully changed!
vi: Thay đổi thành công!

# txtCurrentPassword
source: Current password
vi: Mật khẩu hiện tại

# txtNewPassword
source: New password
vi: Mật khẩu mới

# txtConfirmPassword
source: Confirm password
vi: Xác nhận mật khẩu

# txtThirdPartyChangePassword
source: This feature does not work with accounts signed in with third-party
vi: Tính năng này không hoạt động đối với tài khoản đăng nhập bằng các bên thứ ba.

# txtMale
source: Male
vi: Nam

# txtFemale
source: Female
vi: Nữ

# txtOthers
source: Others
vi: Khác

# txtNotification
source: Notification
vi: Thông báo

# txtMarkAllNotiAsRead
source: Mark all notifications as read
vi: Đánh dấu tất cả thông báo là đã đọc

# txtMarkAllNotiAsUnread
source: Mark all notifications as unread
vi: Đánh dấu tất cả thông báo là chưa đọc

# txtEditNotiSettings
source: Edit notifications settings
vi: Thay đổi cài đặt thông báo

# txtAppearance
source: Appearance
vi: Giao diện

# txtLanguage
source: Language (Ngôn ngữ)
vi: Ngôn ngữ (Language)

# txtGiveFeedback
source: Give Feedback
vi: Cho đánh giá

# txtAbout
source: About
vi: Thông tin ứng dụng

# txtApplicationTheme
source: Application Theme
vi: Chủ đề màu sắc ứng dụng

# txtDarkMode
source: Dark Mode
vi: Chế độ tối

# txtNotifyMeAbout
source: Notify me about
vi: Thông báo cho tôi về

# txtDealsAndDiscounts
source: Deals and Discounts
vi: Giảm giá

# txtNewTopics
source: New Topics
vi: Các chủ đề mới

# txtNewTeachers
source: New Teachers
vi: Các giáo viên mới

# txtSounds
source: Sounds
vi: Âm thanh

# txtVibrations
source: Vibrations
vi: Độ rung

# txtEnglish
source: English (Tiếng Anh)
vi: Tiếng Anh (English)

# txtVietnamese
source: Vietnamese (Tiếng Việt)
vi: Tiếng Việt (Vietnamese)

# txtRateOurApp
source: Rate Our App
vi: Đánh giá app của chúng tôi

# txtPleaseTellUsWatUThink
source: Please tell us what you think
vi: Vui lòng cho chúng tôi biết ý kiến của bạn

# txtSend
source: Send
vi: Gửi

# txtCentalkiDescription
source: Practice English speaking with foreign teachers
vi: Luyện nói tiếng Anh với giáo viên nước ngoài

# txtCentalkiSource
source: Developed by Centalki Team 2023, All Rights Reserved Contact: centalki.dev@gmail.com
vi: Phát triển bởi Centalki Team 2023, Bản quyền được bảo lưu Thông tin liên hệ: centalki.dev@gmail.com

# txtCentalkiVersion
source: Version 0.4.0
vi: Phiên bản 1.1.0

# txtLastUpdated
source: Last updated: Mar 03, 2023
vi: Lần cuối cập nhật: Ngày 21 tháng 5 năm 2023

# txtRatingEmptyError
source: Rating cannot be empty
vi: Đánh giá sao không được để trống

# txtFeedbackEmptyError
source: Feedback cannot be empty
vi: Đánh giá chi tiết không được để trống

# txtSuccessFeedback
source: Send feedback successfully
vi: Gửi đánh giá thành công!

# txtSuccess
source: Success
vi: Thành công

# txtLoadFail
source: Load failed
vi: Tải thất bại

# txtFeedbackTooLong
source: Feedback cannot exceed 500 characters
vi: Phản hồi không thề vượt quá 500 ký tự

# txtBuyMoreSessions
source: Buy More Sessions
vi: Mua thêm buổi học

# txtChoosePaymentMethod
source: Choose payment method
vi: Chọn phương thức thanh toán

# txtPaymentInformation
source: Payment Information
vi: Thông tin thanh toán

# txtInstructions
source: Instructions
vi: Hướng dẫn

# txtPricePerSessionAnnounce
source: The price for each session is
vi: Giá mỗi buổi học là

# txtPaymentInstructionDetail
source: Multiply it with the number of session you want to buy, then transfer the money using the QR Code provided above.
vi: Nhân đơn giá với số buổi học mà bạn muốn mua, và sử dụng mã QR có sẵn phía trên để chuyển tiền.

# txtPaymentBillUpload
source: Upload your bill so that we can verify your payment
vi: Tải lên ảnh chụp màn hình hóa đơn chuyển khoản của bạn để xác nhận

# txtUpload
source: Upload
vi: Tải lên

# txtChooseFromLibrary
source: Choose from Gallery
vi: Chọn từ thư viện

# txtTakeAPic
source: Using Camera
vi: Chọn từ máy ảnh

# txtSelfReviewTitle
source: Please tell us your current English level
vi: Vui lòng cho chúng tôi biết trình độ tiếng Anh hiện tại của bạn

# txtSelfReviewContent
source: This information will enable us to guide you better and recommend suitable contents for you
vi: Thông tin này sẽ giúp chúng tôi hướng dẫn và đề xuất các nội dung phù hợp cho bạn hơn.

# txtAddFavoriteSuccess
source: Add favorite topic successfully!
vi: Lưu chủ đề yêu thích thành công!

# txtRemove
source: Remove
vi: Xoá

# txtConfirmRemoveFavoriteTitle
source: Remove from Favorite
vi: Xóa chủ đề yêu thích

# txtConfirmRemoveFavoriteContent
source: Are you sure to remove this from your favorite topics? You can still add them back later.
vi: Bạn có muốn xóa chủ đề được chọn khỏi danh sách yêu thích không? Bạn vẫn có thể thêm chúng vào lại sau này.

# txtRemoveFavoriteSuccess
source: Remove favorite topic successfully!
vi: Xóa khỏi danh sách yêu thích thành công!

# txtConfirmRemoveSavedTitle
source: Remove from Saved
vi: Xóa từ vựng đã lưu

# txtConfirmRemoveSavedContent
source: Are you sure to remove this from your saved vocabularies? You can still add them back later.
vi: Bạn có muốn xóa từ vựng được chọn khỏi danh sách đã lưu không? Bạn vẫn có thể thêm chúng vào lại sau này.

# txtTopicsTab
source: Topics
vi: Chủ đề

# txtVocabsTab
source: Vocabularies
vi: Từ vựng

# txtNoFavoriteTopicsTitle
source: You Have No Favorite Topic
vi: Bạn hiện chưa có chủ đề nào trong danh sách yêu thích của mình

# txtNoFavoriteTopicsContent
source: Explore our topics and tap the heart icon to save topics you love.
vi: Khám phá các chủ đề nói của chúng tôi, và chạm vào biểu tượng trái tim để thêm chúng vào danh sách yêu thích của bạn.

# txtNoFavoriteVocabsTitle
source: You Have Not Saved Any Phrases
vi: Bạn hiện chưa có từ vựng nào trong danh sách đã lưu

# txtNoFavoriteVocabsContent
source: Explore our topics contents and tap the bookmark icon to save any word or phrase you want to learn.
vi: Khám phá nội dung các chủ đề nói của chúng tôi và chạm vào biểu tượng lưu để thêm chúng vào danh sách từ mà bạn muốn học.

# txtCongrats
source: Congrats!
vi: Xin chúc mừng!

# txtSessionCompletedBody
source: You have completed a 30-minute session. Keep up your good work!
vi: Bạn đã hoàn thành buổi học 30 phút của mình. Cố gắng giữ vững phong độ trong lần tới nhé

# txtSessionCompletedAskForFeedback
source: What are your thoughts on the teacher?
vi: Bạn suy nghĩ về giáo viên của buổi học?

# txtSessionCompletedFeedbackBtn
source: Feedback for Teacher Now
vi: Đưa ra phản hồi cho giáo viên ngay

# txtDoItLater
source: I will do it later
vi: Tôi sẽ thực hiện sau

# txtSessionCompletedAskForReport
source: Any issue while studying?
vi: Bạn gặp trục trặc trong quá trình học?

# txtSessionCompletedReportBtn
source: Report
vi: Báo cáo sự cố

# txtSessionFeedback
source: Session Feedback
vi: Phản hồi buổi học

# txtRating
source: Rating
vi: Đánh giá

# txtSatisfiedDesciptionLabel
source: What did the teacher make you satisfied with?
vi: Điểm nào ở giáo viên làm bạn hài lòng?

# txtNotSatisfiedDesciptionLabel
source: What did the teacher make you not satisfied with?
vi: Điểm nào ở giáo viên làm bạn chưa hài lòng

# txtDescriptionLabel
source: Description
vi: Mô tả

# txtSatisfiedDescriptionHint
source: It would be nice if you could tell teacher more about what made your experiences good.
vi: Sẽ rất tuyệt vời nếu bạn có thể nói cho giáo viên biết rõ hơn những điểm mang lại trải nghiệm tốt.

# txtNotSatisfiedDescriptionHint
source: It would be nice if you could tell teacher more about what made your experiences not good.
vi: Giáo viên sẽ rất trân trọng nếu bạn có thể nói rõ hơn những điểm mang lại trải nghiệm CHƯA tốt.

# txtSuggetionsLabel
source: Suggestions for Teacher
vi: Đề xuất cho giáo viên

# txtSuggetionsHint
source: Teachers are always welcomed to hear any suggestion that you believe will improve your overall experiences for future sessions.
vi: Giáo viên luôn sẵn sàng lắng nghe những góp ý, đề xuất mà bạn tin rằng sẽ cải thiện trải nghiệm của các buổi học sau.

# txtSatisfiedChipNotEmpty
source: Please choose at least one option
vi: Vui lòng chọn ít nhất 1 tiêu chí

# txtDescriptionNotEmpty
source: Description cannot be empty
vi: Mô tả không thể để trống

# txtDescriptionTooLong
source: Description cannot exceed 500 characters
vi: Mô tả không thể vượt quá 500 ký tự

# txtSuggestionsTooLong
source: Suggestions cannot exceed 500 characters
vi: Góp ý, đề xuất không thể vượt quá 500 ký tự

# txtSendFeedbackSuccess
source: Send feedback successfully
vi: Gửi phản hồi thành công

# txtSendFeedbackFailed
source: Send feedback failed
vi: Gửi phản hồi thất bại

# txtFeedbackForTeacherBtn
source: Feedback for Teacher
vi: Phản hồi cho giáo viên

# txtRatingFromTeacher
source: Rating from Teacher
vi: Chấm điểm từ giáo viên

# txtFeedbackFromTeacher
source: Feedback from Teacher
vi: Phản hồi từ giáo viên

# txtPronunciation
source: Pronunciation
vi: Phát âm

# txtVocabularies
source: Vocabularies
vi: Từ vựng

# txtGrammar
source: Grammar
vi: Ngữ pháp

# txtIdea
source: Idea
vi: Ý tưởng

# txtFluency
source: Fluency
vi: Độ trôi chảy

# txtSuggestions
source: Suggestions
vi: Góp ý, đề xuất

# txtFeedbackEmptyHeadline
source: No Feedback Yet
vi: Giáo viên chưa phản hồi

# txtFeedbackEmptyContent
source: You will receive a notification right after the teacher provides feedback.
vi: Bạn sẽ nhận được thông báo ngay khi giáo viên đưa ra phản hồi cho bạn.

# txtTopicFeedback
source: Topic Feedback
vi: Góp ý cho chủ đề

# txtBackBtn
source: Back
vi: Quay về

# txtNextBtn
source: Next
vi: Tiếp tục

# txtSendBtn
source: Send
vi: Gửi

# txtTopicName
source: Topic's Name
vi: Tên chủ đề

# txtTopicFeedbackCommonHint
source: We appreciate any detailed feedback from you, if possible.
vi: Chúng tôi đánh giá cao mọi phản hồi chi tiết từ bạn, nếu có thể.

# txtIllustrationPhoto
source: Illustration Photo
vi: Ảnh minh hoạ

# txtTopicDescriptionFeedback
source: Topic's Description
vi: Mô tả chủ đề

# txtQuestionsAndAnswers
source: Questions and Answers
vi: Câu hỏi và câu trả lời
